mark1/trunk/doc/www.cafeconleche.org/books/xmljava/examples/16/soap-response.xml

<?xml version="1.0"?>
<!-- XPath data model example -->
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" />
  <SOAP-ENV:Body>
    <Quote 
      xmlns="http://namespaces.cafeconleche.org/xmljava/ch2/">
      <Price currency="USD">4.12</Price>
    </Quote>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
